-- -------------------
-- insert administrators
-- -------------------

-- ----------------------
-- insert  users
-- ----------------------
-- insert publication
-- ----------------------
use mydb;
INSERT INTO catalog_periodicals (title,  discription,  output_frequency, price) VALUES
  ('Вяселка', 'Развлекательный журнал','1','1.35'),
  ('СпидИнфо','Еженедельная газета','2','3.25'),
  ('Вечерний Витебск','Еженедельный обозреватель','8','1.47'),
  ('Секретные исследования','фантастическая газета','4','1.29'),
  ('Камсомолка','Еженедельная газета','2','2.85'),
  ('Аргументы и Факты','Еженедельная газета','1','3.85'),
  ('Вечерний Витебск','ежедневный обозреватель','2','7.47'),
  ('Работа','вакансии и спрос','8','1.29');

