-- -------------------
-- insert administrators
-- -------------------

-- ----------------------
-- insert  users
-- ----------------------
  USE mydb;
insert INTO users(name, email, password,enabled,role) VALUES
  ('User','user@yandex.ru','user','0','USER'),
  ('Admin','admin@gmail.com','admin','0','ADMIN');
-- insert publication
-- ----------------------
use mydb;
INSERT INTO catalogpublications (title, discription, price) VALUES
  ('Вяселка','Развлекательный журнал','1.35'),
  ('СпидИнфо','Еженедельная газета','3.25'),
  ('Вечерний Витебск','ежедневный обозреватель','7.47'),
  ('Секретные исследования','фантастическая газета','1.29'),
  ('Камсомолка','Еженедельная газета','2.85'),
  ('Аргументы и Факты','Еженедельная газета','3.85'),
  ('Вечерний Витебск','ежедневный обозреватель','7.47'),
  ('Работа','вакансии и спрос','1.29');

