-- -------------------
-- insert administrators
-- -------------------
use mydb;

--   INSERT INTO administrators (login, password) VALUES
--   ('admin',"admin");

-- ----------------------
-- insert  users
-- ----------------------

-- insert catalog
-- ----------------------
use mydb;
INSERT INTO catalogpublications (title, discription, price) VALUES
  ('Вяселка','Развлекательный журнал','135'),
  ('СпидИнфо','Еженедельная газета','325'),
  ('Вечерний Витебск','ежедневный обозреватель','747'),
  ('Секретные исследования','фантастическая газета','129'),
  ('Камсомолка','Еженедельная газета','285'),
  ('Аргументы и Факты','Еженедельная газета','385'),
  ('Вечерний Витебск','ежедневный обозреватель','747'),
  ('Работа','вакансии и спрос','129');

